pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014 Renesas Electronics Corporation. All rights reserved.    
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_ether_rx.c
* Version      : 1.02
* Description  : Ethernet module device driver
***********************************************************************************************************************/
/***********************************************************************************************************************
* History : DD.MM.YYYY Version  Description
*         : 22.07.2014 1.00     First Release
*         : 16.12.2014 1.01     Made changes related to header file include.
*         : 27.03.2015 1.02     Changed the R_ETHER_LinkProcess() Function
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <string.h>
#include <machine.h>

/* Access to peripherals and board defines. */
#include "platform.h"

#include "r_ether_rx_if.h"
#include "src/r_ether_rx_private.h"

#include "r_t4_itcpip.h"		//PWBF ADDED
#include "r_t4_dhcp_client_rx_if.h"	//PWBF ADDED
#include "globalVar.h"			//PWBF ADDED

static UW tcpudp_work[ 21504 / sizeof(UW)]; // calculated by W tcpudp_get_ramsize( void ) //HUNTER ADDED
extern uint8_t _myethaddr[][6];			//PWBF ADDED
extern bool ETHERNET_RDY[2];
/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define MINIMUM_SIZES_OF_ETHER_FRAME_EXCEPT_CRC     (60)

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables (to be accessed by other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

/*
 * Private global function prototypes
 */
static void             ether_reset_mac(uint32_t channel);
static void             ether_init_descriptors(uint32_t channel);
static void             ether_config_ethernet(uint32_t channel, const uint8_t mode);
static void             ether_pause_resolution(uint16_t local_ability, uint16_t partner_ability,
                                               uint16_t *ptx_pause, uint16_t *prx_pause);
static void             ether_configure_mac(uint32_t channel, const uint8_t mac_addr[], const uint8_t mode);
static ether_return_t   ether_do_link(uint32_t channel, const uint8_t mode);
static ether_return_t   ether_set_callback(ether_param_t const control);
static ether_return_t   ether_set_promiscuous_mode(ether_param_t const control);
static ether_return_t   ether_set_int_handler(ether_param_t const control);
static ether_return_t   ether_power_on(ether_param_t const control);
static ether_return_t   ether_power_off(ether_param_t const control);
static ether_return_t   power_on(uint32_t channel);
static void             power_off(uint32_t channel);
static void             ether_eint0(void * pparam);
static void             ether_eint1(void * pparam);
static void             ether_int_common(uint32_t channel);
static ether_return_t   power_on_control(uint32_t channel);
static void             power_off_control(uint32_t channel);
static uint8_t          check_mpde_bit(void);

/*
 * Private global variables
 */

/* Pointer to the receive descriptors */
static descriptor_t   * papp_rx_desc[ETHER_CHANNEL_MAX] = {NULL, NULL};

/* Pointer to the transmit descriptors */
static descriptor_t   * papp_tx_desc[ETHER_CHANNEL_MAX] = {NULL, NULL};

