pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
/* Pointer to the callback function */
static ether_cb_t       cb_func;

static bool             is_entry = false;

/* 
 * The flag which control the pause frame.
 *
 * The value of flag and the situation which is indicatived of by the value.
 * ETHER_FLAG_OFF (0): Don't use the pause frame (default). 
 * ETHER_FLAG_ON  (1): Use the pause frame. 
 */
static uint8_t          pause_frame_enable[ETHER_CHANNEL_MAX] = { ETHER_FLAG_OFF, ETHER_FLAG_OFF };

/*
 * The flag indicatives of the state that the interrupt of Link Up/Down occur.
 * 
 * Value and state of flag
 * ETHER_FLAG_OFF (0): It is not possible to communicate. 
 * ETHER_FLAG_ON  (1): It is possible to communicate. 
 */
static uint8_t  transfer_enable_flag[ETHER_CHANNEL_MAX];

/*
 * The flag indicatives of the state that the interrupt of magic packet detection occur.
 *
 * Value and state of flag
 * ETHER_FLAG_OFF (0): The interrupt of the magic packet detection has not been generated. 
 * ETHER_FLAG_ON  (1): The interrupt of the magic packet detection was generated. 
 *
 * If the R_ETHER_LinkProcess function is called, and the interrupt processing of the magic packet detection is done,
 * this flag becomes ETHER_FLAG_OFF(0). 
 */
static uint8_t  mpd_flag[ETHER_CHANNEL_MAX];

static uint8_t  mac_addr_buf[ETHER_CHANNEL_MAX][6];

/*
 * The flag indicatives of the state that the interrupt of Link Up/Down occur.
 * 
 * Value and state of flag
 * ETHER_FLAG_OFF         (0) : The Link up/down interrupt has not been generated. 
 * ETHER_FLAG_ON_LINK_OFF (2) : The Link down interrupt was generated. 
 * ETHER_FLAG_ON_LINK_ON  (3) : The Link up interrupt was generated. 
 * 
 * If the R_ETHER_LinkProcess function is called, and the interrupt processing of Link Up/Down is done,
 * this flag becomes ETHER_FLAG_OFF(0). 
 */
static uint8_t  lchng_flag[ETHER_CHANNEL_MAX];

/*
 * PAUSE Resolution as documented in IEEE 802.3-2008_section2 Annex
 * 28B, Table 28B-3. The following table codify logic that
 * determines how the PAUSE is configured for local transmitter
 * and receiver and partner transmitter and receiver.
 */
static const pauseresolution_t pause_resolution[PAUSE_TABLE_ENTRIES] =
{
    { PAUSE_MASKC, PAUSE_VAL0, XMIT_PAUSE_OFF, RECV_PAUSE_OFF },
    { PAUSE_MASKE, PAUSE_VAL4, XMIT_PAUSE_OFF, RECV_PAUSE_OFF },
    { PAUSE_MASKF, PAUSE_VAL6, XMIT_PAUSE_OFF, RECV_PAUSE_OFF },
    { PAUSE_MASKF, PAUSE_VAL7, XMIT_PAUSE_ON,  RECV_PAUSE_OFF },
    { PAUSE_MASKE, PAUSE_VAL8, XMIT_PAUSE_OFF, RECV_PAUSE_OFF },
    { PAUSE_MASKA, PAUSE_VALA, XMIT_PAUSE_ON,  RECV_PAUSE_ON  },
    { PAUSE_MASKF, PAUSE_VALC, XMIT_PAUSE_OFF, RECV_PAUSE_OFF },
    { PAUSE_MASKF, PAUSE_VALD, XMIT_PAUSE_OFF, RECV_PAUSE_ON  }
};

/*
 * Receive, transmit descriptors and their buffer.  They are
 * defined with section pragma directives to easily locate them
 * on the memory map.
 */
#pragma section _RX_DESC
static descriptor_t    rx_descriptors[ETHER_CHANNEL_MAX][ETHER_CFG_EMAC_RX_DESCRIPTORS];
#pragma section _TX_DESC
static descriptor_t    tx_descriptors[ETHER_CHANNEL_MAX][ETHER_CFG_EMAC_TX_DESCRIPTORS];

/* 
 * As for Ethernet buffer, the size of total buffer which are use for transmission and the reception is secured.
 * The total buffer's size which the value is integrated from  EMAC_NUM_BUFFERS (buffer number) and 
 * ETHER_CFG_BUFSIZE (the size of one buffer).
 * The ETHER_CFG_BUFSIZE and EMAC_NUM_BUFFERS are defined by macro in the file "r_ether_private.h".
 * It is sequentially used from the head of the buffer as a receive buffer or a transmission buffer.
 */
#pragma section _ETHERNET_BUFFERS
static etherbuffer_t   ether_buffers[ETHER_CHANNEL_MAX];

#pragma section

static  uint8_t         promiscuous_mode[ETHER_CHANNEL_MAX];


static const ether_control_t ether_ch_0[]=
{
    /* Ether = ch0, Phy access = ch0 */
    {   &ETHERC0,    &EDMAC0,    &ETHERC0.PIR.LONG,  ETHER_CFG_CH0_PHY_ADDRESS, PORT_CONNECT_ET0        },

    /* Ether = ch0, Phy access = ch1 */
    {   &ETHERC0,    &EDMAC0,    &ETHERC1.PIR.LONG,  ETHER_CFG_CH0_PHY_ADDRESS, PORT_CONNECT_ET0_ET1    }
};

static const ether_control_t ether_ch_1[]=
{
    /* Ether = ch1, Phy access = ch0 */
    {   &ETHERC1,    &EDMAC1,    &ETHERC0.PIR.LONG,  ETHER_CFG_CH1_PHY_ADDRESS, PORT_CONNECT_ET0_ET1    },

    /* Ether = ch1, Phy access = ch1 */
    {   &ETHERC1,    &EDMAC1,    &ETHERC1.PIR.LONG,  ETHER_CFG_CH1_PHY_ADDRESS, PORT_CONNECT_ET1        }
};

#if ETHER_CFG_CH0_PHY_ACCESS > 1
    #error "ERROR - ETHER_CFG_CH0_PHY_ACCESS - Unknown register bus is defined in r_ether_rx_config.h"
#endif
#if ETHER_CFG_CH1_PHY_ACCESS > 1
    #error "ERROR - ETHER_CFG_CH1_PHY_ACCESS - Unknown register bus is defined in r_ether_rx_config.h"
#endif

/* This table is used to convert it from the channel number for the communication
   into the channel number for the PHY register access. */
   
static const uint32_t  ether_phy_access[] = 
{
    ETHER_CFG_CH0_PHY_ACCESS,
    ETHER_CFG_CH1_PHY_ACCESS
};


static uint8_t etherc_edmac_power_cont[2][2];

const ether_ch_control_t g_eth_control_ch[] =
{
    {   ether_ch_0, ETHER_CFG_CH0_PHY_ACCESS    },
    {   ether_ch_1, ETHER_CFG_CH1_PHY_ACCESS    }
}; 

/*
 * Renesas Ethernet API functions
 */
/***********************************************************************************************************************
* Function Name: R_ETHER_Initial (Implementation to file hwsetup.c)
* Description  : Initialization of Ether driver.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
void R_ETHER_Initial(void)
{
    /* Initialize the transmit and receive descriptor */
    memset(&rx_descriptors, 0x00, sizeof(rx_descriptors));
    memset(&tx_descriptors, 0x00, sizeof(tx_descriptors));

    /* Initialize the Ether buffer */
    memset(&ether_buffers,  0x00, sizeof(ether_buffers));
    
    memset(etherc_edmac_power_cont,  0x00, sizeof(etherc_edmac_power_cont));

    /* Initialize the callback function pointer */
    cb_func.pcb_func = NULL;

    /* Initialize the interrupt handler pointer */
    cb_func.pcb_int_hnd = NULL;

    /* Initialize */
    promiscuous_mode[ETHER_CHANNEL_0] = ETHER_PROMISCUOUS_OFF;
    promiscuous_mode[ETHER_CHANNEL_1] = ETHER_PROMISCUOUS_OFF;

} /* End of function R_ETHER_Initial() */

