pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
* Function Name: R_ETHER_Open_ZC2
* Description  : After ETHERC, EDMAC,0x00000002; and PHY-LSI are reset in software, an auto negotiation of PHY-LSI is
*                 begun.
*                Afterwards, the link signal change interrupt is permitted. 
* Arguments    : channel -
*                    ETHERC channel number
*                mac_addr -
*                    The MAC address of ETHERC
*                pause -
*                    Specifies whether flow control functionality is enabled or disabled.
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_INVALID_PTR -
*                    Value of the pointer is NULL or FIT_NO_PTR
*                ETHER_ERR_INVALID_DATA -
*                    Value of the argument is out of range
*                ETHER_ERR_OTHER -
*                    
***********************************************************************************************************************/
ether_return_t R_ETHER_Open_ZC2(uint32_t channel, const uint8_t mac_addr[], uint8_t pause)
{
    ether_return_t          ret;
    int16_t                 phy_ret;
    volatile bsp_int_err_t  bsp_int_err;
    const ether_control_t * pether_ch;
    uint32_t                phy_access;

    volatile struct st_etherc __evenaccess    * etherc_adr;
    volatile struct st_edmac __evenaccess     * edmac_adr;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == mac_addr) || (FIT_NO_PTR == mac_addr))
    {
        return ETHER_ERR_INVALID_PTR;
    }
    if ((ETHER_FLAG_OFF != pause) && (ETHER_FLAG_ON != pause))
    {
        return ETHER_ERR_INVALID_DATA;
    }

    pether_ch  = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    etherc_adr = pether_ch[phy_access].petherc;
    edmac_adr  = pether_ch[phy_access].pedmac;

    /* Initialize the flags */
    transfer_enable_flag[channel] = ETHER_FLAG_OFF;
    mpd_flag[channel]             = ETHER_FLAG_OFF;
    lchng_flag[channel]           = ETHER_FLAG_OFF;

    pause_frame_enable[channel] = pause;

    mac_addr_buf[channel][0] = mac_addr[0];
    mac_addr_buf[channel][1] = mac_addr[1];
    mac_addr_buf[channel][2] = mac_addr[2];
    mac_addr_buf[channel][3] = mac_addr[3];
    mac_addr_buf[channel][4] = mac_addr[4];
    mac_addr_buf[channel][5] = mac_addr[5];

    /* Subscribe to r_bsp an interrupt function */
    if(false == is_entry)
    {
        bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC0_EINT0, ether_eint0);  /* EINT0 */
        bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC1_EINT1, ether_eint1);  /* EINT1 */
        is_entry    = true;
    }
    
    /* Software reset */
    ether_reset_mac(channel);

    /* Software reset the PHY */
    phy_ret = phy_init(channel);
    if (R_PHY_OK == phy_ret)
    {
        phy_start_autonegotiate(channel, pause_frame_enable[channel]);
        
        /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */
        etherc_adr->ECSR.LONG = 0x00000037;

        /* Clear all EDMAC status bits */
        edmac_adr->EESR.LONG  = 0x47FF0F9F;

        /* Enable interrupts of interest only. */
        etherc_adr->ECSIPR.BIT.LCHNGIP = 1;

        edmac_adr->EESIPR.BIT.ECIIP    = 1;

        /* Set Ethernet interrupt level and enable */
        ether_enable_icu(channel);

        ret = ETHER_SUCCESS;
    }
    else
    {
        ret = ETHER_ERR_OTHER;
    }

    return ret;
} /* End of function R_ETHER_Open_ZC2() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Close_ZC2
* Description  : Disables Ethernet peripheral
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
***********************************************************************************************************************/
ether_return_t R_ETHER_Close_ZC2(uint32_t channel)
{
    volatile struct st_etherc __evenaccess    * etherc_adr;
    volatile struct st_edmac __evenaccess     * edmac_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    pether_ch  = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    etherc_adr = pether_ch[phy_access].petherc;
    edmac_adr  = pether_ch[phy_access].pedmac;

    /* Disable Ethernet interrupt. */
    ether_disable_icu(channel);
    
    etherc_adr->ECSIPR.BIT.LCHNGIP = 0;
    edmac_adr->EESIPR.BIT.ECIIP    = 0;
    
    ether_clear_icu_source(channel);
    
    /* Disable TE and RE  */
    etherc_adr->ECMR.LONG  = 0x00000000;
    
    /* Initialize the flags */
    transfer_enable_flag[channel] = ETHER_FLAG_OFF;
    mpd_flag[channel]             = ETHER_FLAG_OFF;
    lchng_flag[channel]           = ETHER_FLAG_OFF;

    return ETHER_SUCCESS;
} /* End of function R_ETHER_Close_ZC2() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Read_ZC2
* Description  : Receives an Ethernet frame.  Sets the passed
*                buffer pointer to the Ethernet frame buffer
*                from the driver. This makes the data available to
*                the caller as a zero-copy operation.
* Arguments    : channel -
*                    ETHERC channel number
*                pbuf -
*                    Pointer to buffer that holds the receive data
* Return Value : Returns the number of bytes received.
*                ETHER_NO_DATA -
*                    A zero value indicates no data is received.
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_INVALID_PTR -
*                    Value of the pointer is NULL or FIT_NO_PTR
*                ETHER_ERR_LINK - 
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_MPDE -
*                    As a Magic Packet is being detected, transmission and reception is not enabled.
***********************************************************************************************************************/
int32_t R_ETHER_Read_ZC2(uint32_t channel, void **pbuf)
{
    int32_t     num_recvd;
    int32_t     ret;
    int32_t     complete_flag;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (check_mpde_bit())
    
    {
        ret = ETHER_ERR_MPDE;
    }

