pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
    /* When the Link up processing is completed */
    else
    {
        complete_flag = ETHER_ERR_OTHER;
        while (ETHER_SUCCESS != complete_flag)
        {
            /* When receive data exists. */
            if (RACT != (papp_rx_desc[channel]->status & RACT))
            {
                if (papp_rx_desc[channel]->status & RFE)
                {
                    /* The buffer is released at the error.  */
                    ret = R_ETHER_Read_ZC2_BufRelease(channel);
                }
                else
                {
                    /**
                     * Pass the pointer to received data to application.  This is
                     * zero-copy operation.
                     */
                    (*pbuf) = (void *)papp_rx_desc[channel]->buf_p;

                    /* Get bytes received */
                    num_recvd     = papp_rx_desc[channel]->size;
                    ret           = num_recvd;
                    complete_flag = ETHER_SUCCESS;
                }
            }
            else
            {
                ret           = ETHER_NO_DATA;
                complete_flag = ETHER_SUCCESS;
            }
        }
    }
    return ret;
} /* End of function R_ETHER_Read_ZC2() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Read_ZC2_BufRelease
* Description  : Release the receive buffer.
* Arguments    : channel -
*                    Specifies the ETHERC channel number.
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_LINK - 
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_MPDE -
*                    As a Magic Packet is being detected, transmission and reception is not enabled.
***********************************************************************************************************************/
int32_t R_ETHER_Read_ZC2_BufRelease(uint32_t channel)
{
    int32_t     ret;
    volatile struct st_edmac __evenaccess * edmac_adr;
    const ether_control_t                 * pether_ch;
    uint32_t                                phy_access;
    
    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (check_mpde_bit())

    {
        ret = ETHER_ERR_MPDE;
    }

    /* When the Link up processing is completed */
    else
    {
        /* When receive data exists */
        if (RACT != (papp_rx_desc[channel]->status & RACT))
        {
            /* Move to next descriptor */
            papp_rx_desc[channel]->status |= RACT;
            {
                uint32_t   status;
                
                status  = RFP1;
                status |= RFP0;
                status |= RFE;
                status |= RFS9_RFOVER;
                status |= RFS8_RAD;
                status |= RFS7_RMAF;
                status |= RFS4_RRF;
                status |= RFS3_RTLF;
                status |= RFS2_RTSF;
                status |= RFS1_PRE;
                status |= RFS0_CERF;
                
                papp_rx_desc[channel]->status &= (~status);
            }
            papp_rx_desc[channel] = papp_rx_desc[channel]->next;
        }
        pether_ch  = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        edmac_adr  = pether_ch[phy_access].pedmac;
        
        if (0x00000000L == edmac_adr->EDRRR.LONG)
        {
            /* Restart if stopped */
            edmac_adr->EDRRR.LONG = 0x00000001L;
        }
        
        ret = ETHER_SUCCESS;
    }
    return ret;
} /* End of function R_ETHER_Read_ZC2_BufRelease() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Write_ZC2_GetBuf
* Description  : Get Points to the buffer pointer used by the stack.
* Arguments    : channel -
*                    ETHERC channel number
*                pbuf -
*                    Pointer to the starting address of the transmit data destination
*                pbuf_size -
*                    The Maximum size to write to the buffer
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_INVALID_PTR -
*                    Value of the pointer is NULL or FIT_NO_PTR
*                ETHER_ERR_LINK - 
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_MPDE - 
*                    As a Magic Packet is being detected, transmission and reception is not enabled.
*                ETHER_ERR_TACT -
*                    Transmit buffer is not empty.
***********************************************************************************************************************/
ether_return_t R_ETHER_Write_ZC2_GetBuf(uint32_t channel, void **pbuf, uint16_t *pbuf_size)
{
    ether_return_t  ret;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }
    if ((NULL == pbuf_size) || (FIT_NO_PTR == pbuf_size))
    {
        return ETHER_ERR_INVALID_PTR;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (check_mpde_bit())
    {
        ret = ETHER_ERR_MPDE;
    }

