pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
    /* When the Link up processing is completed */
    else
    {
        /* All transmit buffers are full */
        if (TACT == (papp_tx_desc[channel]->status & TACT))
        {
            ret = ETHER_ERR_TACT;
        }
        else
        {
            /* Give application another buffer to work with */
            (*pbuf)      = papp_tx_desc[channel]->buf_p;
            (*pbuf_size) = ETHER_CFG_BUFSIZE;
            ret        = ETHER_SUCCESS;
        }
    }
    return ret;
} /* End of function R_ETHER_Write_ZC2_GetBuf() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Write_ZC2_SetBuf
* Description  : Transmits an Ethernet frame. 
*                The transmit descriptor points to the data to transmit. 
*                Data is sent directly from memory as a "zero copy" operation.
* Arguments    : channel -
*                    ETHERC channel number
*                len -
*                    The size (60 to 1,514 bytes) which is the Ethernet frame length minus 4 bytes of CRC
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_INVALID_DATA -
*                    Value of the argument is out of range
*                ETHER_ERR_LINK -
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_MPDE -
*                    As a Magic Packet is being detected, transmission and reception is not enabled.
***********************************************************************************************************************/
ether_return_t R_ETHER_Write_ZC2_SetBuf(uint32_t channel, const uint32_t len)
{
    ether_return_t  ret;
    volatile struct st_edmac __evenaccess * edmac_adr;
    const ether_control_t                 * pether_ch;
    uint32_t                                phy_access;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((ETHER_BUFSIZE_MIN > len) || (ETHER_BUFSIZE_MAX < len))
    {
        return ETHER_ERR_INVALID_DATA;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (check_mpde_bit())
    
    {
        ret = ETHER_ERR_MPDE;
    }

    /* When the Link up processing is completed */
    else
    {
        /* The data of the buffer is made active.  */
        papp_tx_desc[channel]->bufsize = len;
        papp_tx_desc[channel]->status &= (~(TFP1 | TFP0));
        papp_tx_desc[channel]->status |= ((TFP1 | TFP0) | TACT);
        papp_tx_desc[channel]          = papp_tx_desc[channel]->next;
        
        pether_ch  = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        edmac_adr  = pether_ch[phy_access].pedmac;
        
        if (0x00000000L == edmac_adr->EDTRR.LONG)
        {
            /* Restart if stopped */
            edmac_adr->EDTRR.LONG = 0x00000001L;
        }
        
        ret = ETHER_SUCCESS;
    }
    return ret;
} /* End of function R_ETHER_Write_ZC2_SetBuf() */

/***********************************************************************************************************************
* Function Name: R_ETHER_CheckLink_ZC
* Description  : Verifies the Etherent link is up or not.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : ETHER_SUCCESS -
*                    Link is up
*                ETHER_ERR_OTHER -
*                    Link is down
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
***********************************************************************************************************************/
ether_return_t R_ETHER_CheckLink_ZC(uint32_t channel)
{
    int16_t     status;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    status = phy_get_link_status(channel);

    if (R_PHY_ERROR == status)
    {
        /* Link is down */
        return ETHER_ERR_OTHER;
    }
    else
    {
        /* Link is up */
        return ETHER_SUCCESS;
    }
} /* End of function R_ETHER_CheckLink_ZC() */

/***********************************************************************************************************************
* Function Name: R_ETHER_LinkProcess
* Description  : The Link up processing, the Link down processing, and the magic packet detection processing are
*                 executed. 
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : none
***********************************************************************************************************************/
void R_ETHER_LinkProcess(uint32_t channel)
{
    volatile struct st_etherc __evenaccess    * etherc_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;

    int32_t         ret;
    ether_cb_arg_t  cb_arg;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return;
    }

    /* When the magic packet is detected. */
    if (ETHER_FLAG_ON == mpd_flag[channel])
    {
        mpd_flag[channel] = ETHER_FLAG_OFF;
        
        if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
        {
            cb_arg.channel  = channel;
            cb_arg.event_id = ETHER_CB_EVENT_ID_WAKEON_LAN;
            (*cb_func.pcb_func)((void *)&cb_arg);

            /*
             * After the close function is called, the open function is called 
             * to have to set ETHERC to a usual operational mode
             * to usually communicate after magic packet is detected. 
             */
            R_ETHER_Close_ZC2(channel);
            R_ETHER_Open_ZC2(channel, mac_addr_buf[channel], pause_frame_enable[channel]);
            
