pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
        }
    }

    /* When the link is up */
    if (ETHER_FLAG_ON_LINK_ON == lchng_flag[channel])
    {  
	printf(">> ETHER_FLAG_ON_LINK_ON << CH=%d\n",channel);
	ETHERNET_RDY[channel] = STATE_TRUE;
        /* 
         * The Link Up/Down is confirmed by the Link Status bit of PHY register1, 
         * because the LINK signal of PHY-LSI is used for LED indicator, and 
         * isn't used for notifing the Link Up/Down to external device.
         */
        ret = R_ETHER_CheckLink_ZC(channel);
        if (ETHER_SUCCESS == ret)
        {
			printf(">> ETHER_SUCCESS << CH=%d\n",channel);
	   		ETHERNET_RDY[channel] = STATE_TRUE;
            /*
             * The status of the LINK signal became "link-up" even if PHY-LSI did not detect "link-up"
             * after a reset. To avoid this wrong detection, processing in R_ETHER_LinkProcess has been modified to
             * clear the flag after link-up is confirmed in R_ETHER_LinkCheck_ZC.
             */
            lchng_flag[channel] = ETHER_FLAG_OFF;

            /*
             * ETHERC and EDMAC are set after ETHERC and EDMAC are reset in software
             * and sending and receiving is permitted. 
             */
            ether_configure_mac(channel, mac_addr_buf[channel], NO_USE_MAGIC_PACKET_DETECT);
            ether_do_link(channel, NO_USE_MAGIC_PACKET_DETECT);
            
            transfer_enable_flag[channel] = ETHER_FLAG_ON;
            
            if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
            {
                cb_arg.channel  = channel;
                cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_ON;
                (*cb_func.pcb_func)((void *)&cb_arg);
            }
        }
        else
        {
		printf(">> !!ETHER_SUCCESS << CH=%d\n",channel);
            /* no process */
        }
    }

    /* When the link is down */
    else if (ETHER_FLAG_ON_LINK_OFF == lchng_flag[channel])
    {
	printf(">> ETHER_FLAG_ON_LINK_OFF << CH=%d\n",channel);
	ETHERNET_RDY[channel] = STATE_FALSE;
        lchng_flag[channel] = ETHER_FLAG_OFF;

        /* 
         * The Link Up/Down is confirmed by the Link Status bit of PHY register1, 
         * because the LINK signal of PHY-LSI is used for LED indicator, and 
         * isn't used for notifying the Link Up/Down to external device.
         */
        ret = R_ETHER_CheckLink_ZC(channel);
        if (ETHER_ERR_OTHER == ret)
        {
			printf(">> ETHER_ERR_OTHER << CH=%d\n",channel);
            pether_ch  = g_eth_control_ch[channel].pether_control;
            phy_access = g_eth_control_ch[channel].phy_access;
            etherc_adr = pether_ch[phy_access].petherc;
            
            /* Disable receive and transmit. */
            etherc_adr->ECMR.BIT.RE = 0;
            etherc_adr->ECMR.BIT.TE = 0;
            
            transfer_enable_flag[channel] = ETHER_FLAG_OFF;
            
            if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
            {
                cb_arg.channel  = channel;
                cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_OFF;
                (*cb_func.pcb_func)((void *)&cb_arg);
            }
        }
        else
        {
			printf(">> !!ETHER_ERR_OTHER << CH=%d\n",channel);
            ; /* no operation */
        }
    }
    else
    {
        ; /* no operation */
    }
} /* End of function R_ETHER_LinkProcess() */

/***********************************************************************************************************************
* Function Name: R_ETHER_WakeOnLAN
* Description  : The setting of ETHERC is changed from a usual sending and
*                receiving mode to the magic packet detection mode. 
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_LINK - 
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_OTHER -
*                    A switch to magic packet detection was performed when the link state was link is down.
***********************************************************************************************************************/
ether_return_t R_ETHER_WakeOnLAN(uint32_t channel)
{
    volatile struct st_etherc __evenaccess    * etherc_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;
    ether_return_t                              ret;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* When the Link up processing is completed */
    else
    {
        /* Change to the magic packet detection mode.  */
        ether_configure_mac(channel, mac_addr_buf[channel], USE_MAGIC_PACKET_DETECT);
        ret = ether_do_link(channel, USE_MAGIC_PACKET_DETECT);
        if (ETHER_SUCCESS == ret)
        {

            pether_ch  = g_eth_control_ch[channel].pether_control;
            phy_access = g_eth_control_ch[channel].phy_access;
            etherc_adr = pether_ch[phy_access].petherc;

            /* It is confirmed not to become Link down while changing the setting. */
            if (ETHER_CFG_LINK_PRESENT == etherc_adr->PSR.BIT.LMON)
            {
                ret = ETHER_SUCCESS;
            }
            else
            {
                ret = ETHER_ERR_OTHER;
            }
        }
        else
        {
            ret = ETHER_ERR_OTHER;
        }
    }
    return ret;
} /* End of function R_ETHER_WakeOnLAN() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Read
* Description  : Receive Ethernet frame. Receives data to the location specified by the pointer to the receive buffer,
*                using non-zero-copy communication.
* Arguments    : channel -
*                    ETHERC channel number
*                pbuf - 
*                    The receive buffer (to store the receive data)
* Return Value : Returns the number of bytes received.
*                ETHER_NO_DATA -
*                    A zero value indicates no data is received.
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_INVALID_PTR -
*                    Value of the pointer is NULL or FIT_NO_PTR
*                ETHER_ERR_LINK - 
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_MPDE -
*                    As a Magic Packet is being detected, transmission and reception is not enabled.
***********************************************************************************************************************/
int32_t R_ETHER_Read(uint32_t channel, void *pbuf)
{
    int32_t     ret;
    int32_t     ret2;
    uint8_t   * pread_buffer_address;  /* Buffer location controlled by the Ethernet driver */

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }

    /* (1) Retrieve the receive buffer location controlled by the  descriptor. */
    ret = R_ETHER_Read_ZC2(channel, (void **)&pread_buffer_address);
    
