pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
    /* When there is data to receive */
    if (ret > ETHER_NO_DATA)
    {
        /* (2) Copy the data read from the receive buffer which is controlled by the descriptor to
               the buffer which is specified by the user (up to 1024 bytes). */
        memcpy(pbuf, pread_buffer_address, (uint32_t)ret);
        
        /* (3) Read the receive data from the receive buffer controlled by the descriptor,
               and then release the receive buffer. */
        ret2 = R_ETHER_Read_ZC2_BufRelease(channel);

        if (ETHER_SUCCESS == ret2)  /* When this function is completed successfully */
        {
            /* Do Nothing */
        }

        /* Overwrite the error information */
        else
        {
            ret = ret2;
        }
    }

    /* When there is no data to receive */
    else
    {
        /* Do Nothing */
    }
    return ret;
} /* End of function R_ETHER_Read() */

/***********************************************************************************************************************
* Function Name: R_ETHER_Write
* Description  : Transmit Ethernet frame. Transmits data from the location specified by the pointer to the transmit 
*                buffer, with the data size equal to the specified frame length, using non-zero-copy communication.
* Arguments    : channel -
*                    ETHERC channel number
*              : *pbuf -
*                    Transmit buffer pointer
*              : len -
*                    The size (60 to 1,514 bytes) which is the Ethernet frame length minus 4 bytes of CRC
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_INVALID_DATA -
*                    Value of the argument is out of range
*                ETHER_ERR_INVALID_PTR -
*                    Value of the pointer is NULL or FIT_NO_PTR
*                ETHER_ERR_LINK - 
*                    Auto-negotiation is not completed, and reception is not enabled.
*                ETHER_ERR_MPDE -
*                    As a Magic Packet is being detected, transmission and reception is not enabled.
*                ETHER_ERR_TACT -
*                    Transmit buffer is not empty.
***********************************************************************************************************************/
ether_return_t R_ETHER_Write(uint32_t channel, void *pbuf, const uint32_t len)
{
    ether_return_t  ret;
    uint8_t       * pwrite_buffer_address;
    uint16_t        write_buf_size;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }
    if ((ETHER_BUFSIZE_MIN > len) || (ETHER_BUFSIZE_MAX < len))
    {
        return ETHER_ERR_INVALID_DATA;
    }
    
    /* (1) Retrieve the transmit buffer location controlled by the  descriptor. */
    ret = R_ETHER_Write_ZC2_GetBuf(channel, (void **)&pwrite_buffer_address, &write_buf_size);
    
    /* Writing to the transmit buffer (buf) is enabled. */
    if (ETHER_SUCCESS == ret)
    {
        if (write_buf_size < len)
        {
            ret = ETHER_ERR_TACT;   /* Transmit buffer overflow */
        }
        else
        {
            /* Write the transmit data to the transmit buffer. */
            /* 
             * Write 60 to 1514 bytes of data in the transmit buffer (Ethernet frame minus 4 bytes of CRC).
             * To transmit data less than 60 bytes, make sure to pad the data with zero to be 60 bytes.
             */
            if (MINIMUM_SIZES_OF_ETHER_FRAME_EXCEPT_CRC > len)
            {
                memset(pwrite_buffer_address, 0x00, (uint32_t)MINIMUM_SIZES_OF_ETHER_FRAME_EXCEPT_CRC);
            }
            
            /* (2) Write the data to the transmit buffer controlled by the  descriptor. */
            memcpy(pwrite_buffer_address, pbuf, len);
            
            /* (3) Enable the EDMAC to transmit data in the transmit buffer. */
            ret = R_ETHER_Write_ZC2_SetBuf(channel, len);
            
            /* 
             * Confirm that the transmission is completed.
             * Data written in the transmit buffer is transmitted by the EDMAC. Make sure that the
             * transmission is completed after writing data to the transmit buffer.
             * If the R_ETHER_Close_ZC2 function is called to stop the Ethernet communication before
             * verifying that the transmission is completed, the written data written may not be transmitted.
             */
            ret = R_ETHER_CheckWrite(channel);
        }
    }
    return ret;
} /* End of function R_ETHER_Write() */

/***********************************************************************************************************************
* Function Name: R_ETHER_CheckWrite
* Description  : Checking that the data has been sent. 
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
***********************************************************************************************************************/
ether_return_t R_ETHER_CheckWrite(uint32_t channel)
{
    ether_return_t                          ret;
    volatile struct st_edmac __evenaccess * edmac_adr;
    const ether_control_t                 * pether_ch;
    uint32_t                                phy_access;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        ret = ETHER_ERR_INVALID_CHAN;
    }
    else
    {
        pether_ch  = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        edmac_adr  = pether_ch[phy_access].pedmac;
        while (0 != edmac_adr->EDTRR.BIT.TR)
        {
            /* Do Nothing */
        }
        ret = ETHER_SUCCESS;
    }
    return ret;
} /* End of function R_ETHER_CheckWrite() */

