pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
* Function Name: R_ETHER_Control
* Description  : By command argument is a function to change the settings of Ether driver.
* Arguments    : cmd - 
*                    Control code
*                control -
*                    Parameters according to the control code
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
*                ETHER_ERR_CHAN_OPEN -
*                    Indicates the Ethernet cannot be opened because it is being used by another application
*                ETHER_ERR_INVALID_ARG -
*                    Invalid argument
***********************************************************************************************************************/
ether_return_t R_ETHER_Control(ether_cmd_t const cmd, ether_param_t const control)
{
    ether_return_t      ret;

    switch (cmd)
    {
        /* Set the callback function pointer */
        case CONTROL_SET_CALLBACK:
            ret = ether_set_callback(control);
        break;
        
        case CONTROL_SET_PROMISCUOUS_MODE:
            ret = ether_set_promiscuous_mode(control);
        break;
        
        case CONTROL_SET_INT_HANDLER:
            ret = ether_set_int_handler(control);
        break;
        
        case CONTROL_POWER_ON:
            ret = ether_power_on(control);
        break;
        
        case CONTROL_POWER_OFF:
            ret = ether_power_off(control);
        break;
        
        /* Commands not supported */
        default:
            ret = ETHER_ERR_INVALID_ARG;
        break;
    }
    return ret;
} /* End of function R_ETHER_Control() */

/***********************************************************************************************************************
* Function Name: R_ETHER_GetVersion
* Description  : Returns this module's version information.
*                The version number is encoded where the top 2 bytes are the major version number and the bottom 2 bytes
*                are the minor version number. For example, Version 4.25 would be returned as 0x00040019.
* Arguments    : none
* Return Value : Version number
***********************************************************************************************************************/
#pragma inline(R_ETHER_GetVersion)
uint32_t R_ETHER_GetVersion(void)
{
    return ((((uint32_t)ETHER_RX_VERSION_MAJOR) << 16) | ((uint32_t)ETHER_RX_VERSION_MINOR));
} /* End of function R_ETHER_GetVersion() */

/*
 * Private functions
 */

/***********************************************************************************************************************
* Function Name: ether_reset_mac
* Description  : The EDMAC and EtherC are reset through the software reset.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_reset_mac(uint32_t channel)
{
    volatile uint32_t   i;

    /* Software reset */
    if (ETHER_CHANNEL_0 == channel)
    {
        EDMAC0.EDMR.BIT.SWR    = 1;
    }
    else
    {
        EDMAC1.EDMR.BIT.SWR    = 1;
    }
    

    /*
     * Waiting time until the initialization of ETHERC and EDMAC is completed is 64 cycles
     * in the clock conversion of an internal bus of EDMAC. 
     */
    for (i = 0; i < 0x00000100; i++)
    {
        ;
    }

} /* End of function ether_reset_mac() */

/***********************************************************************************************************************
* Function Name: ether_init_descriptors
* Description  : The EDMAC descriptors and the driver buffers are initialized.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_init_descriptors(uint32_t channel)
{
    descriptor_t  * pdescriptor;
    uint32_t        i;

    /* Initialize the receive descriptors */
    for (i = 0; i < ETHER_CFG_EMAC_RX_DESCRIPTORS; i++)
    {
        pdescriptor          = (descriptor_t *)&rx_descriptors[channel][i];
        pdescriptor->buf_p   = (uint8_t *)&(ether_buffers[channel].buffer[i][0]);
        pdescriptor->bufsize = ETHER_CFG_BUFSIZE;
        pdescriptor->size    = 0;
        pdescriptor->status  = RACT;
        pdescriptor->next    = (descriptor_t *)&rx_descriptors[channel][(i + 1)];
    }

    /* The last descriptor points back to the start */
    pdescriptor->status |= RDLE;
    pdescriptor->next    = (descriptor_t *)&rx_descriptors[channel][0];

    /* Initialize application receive descriptor pointer */
    papp_rx_desc[channel] = (descriptor_t *)&rx_descriptors[channel][0];


    /* Initialize the transmit descriptors */
    for (i = 0; i < ETHER_CFG_EMAC_TX_DESCRIPTORS; i++)
    {
        pdescriptor          = (descriptor_t *)&tx_descriptors[channel][i];
        pdescriptor->buf_p   = (uint8_t *)&(ether_buffers[channel].buffer[(ETHER_CFG_EMAC_RX_DESCRIPTORS + i)][0]);
        pdescriptor->bufsize = 1;       /* Set a value equal to or greater than 1. (reference to UMH)
                                           When transmitting data, the value of size is set to the function argument
                                           R_ETHER_Write_ZC2_SetBuf. */
        pdescriptor->size    = 0;       /* Reserved : The write value should be 0. (reference to UMH) */
        pdescriptor->status  = 0;
        pdescriptor->next    = (descriptor_t *)&(tx_descriptors[channel][(i + 1)]);
    }

    /* The last descriptor points back to the start */
    pdescriptor->status |= TDLE;
    pdescriptor->next    = (descriptor_t *)&tx_descriptors[channel][0];

    /* Initialize application transmit descriptor pointer */
    papp_tx_desc[channel] = (descriptor_t *)&tx_descriptors[channel][0];
} /* End of function ether_init_descriptors() */

