pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
* Function Name: ether_config_ethernet
* Description  : Configure the Ethernet Controller (EtherC) and the Ethernet
*                Direct Memory Access controller (EDMAC).
* Arguments    : channel -
*                    ETHERC channel number
*                mode - 
*                   The operational mode is specified. 
*                   NO_USE_MAGIC_PACKET_DETECT (0) - Communicate mode usually
*                   USE_MAGIC_PACKET_DETECT    (1) - Magic packet detection mode
* Return Value : none
***********************************************************************************************************************/
static void ether_config_ethernet(uint32_t channel, const uint8_t mode)
{
    volatile struct st_etherc __evenaccess    * etherc_adr;
    volatile struct st_edmac __evenaccess     * edmac_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return;
    }

    pether_ch  = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    etherc_adr = pether_ch[phy_access].petherc;
    edmac_adr  = pether_ch[phy_access].pedmac;

    /* Magic packet detection mode */
    if (USE_MAGIC_PACKET_DETECT == mode)
    {
        etherc_adr->ECSIPR.LONG = 0x00000006;
        edmac_adr->EESIPR.LONG  = 0x00400000;
    }

    /* Normal mode */
    else
    {
        /* LINK Signal Change Interrupt Enable */
        etherc_adr->ECSIPR.BIT.LCHNGIP = 1;
        edmac_adr->EESIPR.BIT.ECIIP    = 1;

        /*
         * This is sample code.
         * Sets up interrupt when you use interrupts.
         * Enable interrupts of interest only.
         */
        edmac_adr->EESIPR.BIT.FRIP = 1;     /* Enable the frame receive interrupt. */
        edmac_adr->EESIPR.BIT.TCIP = 1;     /* Enable the frame transmit end interrupt. */
    }
    
    /* Ethernet length 1514bytes + CRC and intergap is 96-bit time */
    etherc_adr->RFLR.LONG = 1518;
    etherc_adr->IPGR.LONG = 0x00000014;



#ifdef __LIT
    /* Set little endian mode */
    /* Ethernet length 1514bytes + CRC and intergap is 96-bit time */
    edmac_adr->EDMR.BIT.DE = 1;
#endif /* __LIT */

    /* Initialize Rx descriptor list address */
    /* Casting the pointer to a uint32_t type is valid because the Renesas Compiler uses 4 bytes per pointer. */
    edmac_adr->RDLAR = (void*) papp_rx_desc[channel];
    
    /* Initialize Tx descriptor list address */
    /* Casting the pointer to a uint32_t type is valid because the Renesas Compiler uses 4 bytes per pointer. */
    edmac_adr->TDLAR = (void*) papp_tx_desc[channel];
    
    /* Don't reflect the EESR.RMAF bit status in the RD0.RFS bit in the receive descriptor */
    edmac_adr->TRSCER.LONG = 0x00000080;
    
    /* Threshold of Tx_FIFO */
    /* To prevent a transmit underflow, setting the initial value (store and forward modes) is recommended. */
    edmac_adr->TFTR.LONG = 0x00000000;
    
    /* transmit fifo & receive fifo is 2048 bytes */
    edmac_adr->FDR.LONG  = 0x0000070F;
    
    /*  Configure receiving method
    b0      RNR - Receive Request Bit Reset - Continuous reception of multiple frames is possible.
    b1      RNC - Receive Request Bit Non-Reset Mode - The RR bit is automatically reset.
    b31:b2  Reserved set to 0
    */
    edmac_adr->RMCR.LONG  = 0x00000001;

} /* End of function ether_config_ethernet() */

/***********************************************************************************************************************
* Function Name: ether_pause_resolution
* Description  : Determines PAUSE frame generation and handling. Uses
*                the resolution Table 28B-3 of IEEE 802.3-2008.
* Arguments    : local_ability -
*                    local PAUSE capability (2 least significant bits)
*                partner_ability -
*                    link partner PAUSE capability (2 least significant bits)
*                *ptx_pause -
*                    pointer to location to store the result of the table lookup for transmit
*                    PAUSE. 1 is enable, 0 is disable.
*                *prx_pause -
*                    pointer to location to store the result of the table lookup for receive
*                    PAUSE. 1 is enable, 0 is disable.
* Return Value : none
***********************************************************************************************************************/
static void ether_pause_resolution(uint16_t local_ability, uint16_t partner_ability,
                              uint16_t *ptx_pause, uint16_t *prx_pause)
{
    uint32_t    i;
    uint32_t    ability_compare;

    /*
     * Arrange the bits so that they correspond to the Table 28B-3
     * of the IEEE 802.3 values.
     */
    ability_compare = (uint32_t)(((local_ability & LINK_RES_ABILITY_MASK) << LINK_RES_LOCAL_ABILITY_BITSHIFT) |
                       (partner_ability & LINK_RES_ABILITY_MASK));

    /* Walk through the look up table */
    for (i = 0; i < PAUSE_TABLE_ENTRIES; i++)
    {
        if ((ability_compare & pause_resolution[i].mask) == pause_resolution[i].value)
        {
            (*ptx_pause) = pause_resolution[i].transmit;
            (*prx_pause) = pause_resolution[i].receive;
            return;
        }
    }
} /* End of function ether_pause_resolution() */

/***********************************************************************************************************************
* Function Name: ether_configure_mac
* Description  : Software reset is executed, and ETHERC and EDMAC are configured. 
* Arguments    : channel -
*                    ETHERC channel number
*                mac_addr -
*                    The MAC address of ETHERC
*                mode -
*                    The operational mode is specified. 
*                    NO_USE_MAGIC_PACKET_DETECT (0) - Communicate mode usually
*                    USE_MAGIC_PACKET_DETECT    (1) - Magic packet detection mode
* Return Value : none
***********************************************************************************************************************/
static void ether_configure_mac(uint32_t channel, const uint8_t mac_addr[], const uint8_t mode)
{
    uint32_t    mac_h;
    uint32_t    mac_l;
    volatile struct st_etherc __evenaccess    * etherc_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;

