pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return;
    }
    
    pether_ch  = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    etherc_adr = pether_ch[phy_access].petherc;

    /* Software reset */
    ether_reset_mac(channel);

    /* Set MAC address */ 
    mac_h = (((((uint32_t)mac_addr[0] << 24)  | \
               ((uint32_t)mac_addr[1] << 16)) | \
               ((uint32_t)mac_addr[2] << 8 )) | \
                (uint32_t)mac_addr[3]);

    mac_l = (((uint32_t)mac_addr[4] << 8 ) | \
              (uint32_t)mac_addr[5]);
             
    etherc_adr->MAHR      = mac_h;
    etherc_adr->MALR.LONG = mac_l;

    /* Initialize receive and transmit descriptors */
    ether_init_descriptors(channel);

    /* Perform rest of hardware interface configuration */
    ether_config_ethernet(channel, mode);

} /* End of function ether_configure_mac() */

/***********************************************************************************************************************
* Function Name: ether_do_link
* Description  : Determines the partner PHY capability through
*                auto-negotiation process. The link abilities
*                are handled to determine duplex, speed and flow
*                control (PAUSE frames).
* Arguments    : channel -
*                    ETHERC channel number
*                mode - 
*                    The operational mode is specified. 
*                    NO_USE_MAGIC_PACKET_DETECT (0) - Communicate mode usually
*                    USE_MAGIC_PACKET_DETECT    (1) - Magic packet detection mode
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN -
*                    Nonexistent channel number
*                ETHER_ERR_OTHER -
*                    
***********************************************************************************************************************/
static ether_return_t ether_do_link(uint32_t channel, const uint8_t mode)               
{
    ether_return_t  ret;
    uint16_t        link_speed_duplex  = 0;
    uint16_t        local_pause_bits   = 0;
    uint16_t        partner_pause_bits = 0;
    uint16_t        transmit_pause_set = 0;
    uint16_t        receive_pause_set  = 0;
    uint16_t        full_duplex        = 0;
    uint16_t        link_result        = 0;
    volatile struct st_etherc __evenaccess    * etherc_adr;
    volatile struct st_edmac __evenaccess     * edmac_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    pether_ch  = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    etherc_adr = pether_ch[phy_access].petherc;
    edmac_adr  = pether_ch[phy_access].pedmac;

    /* Set the link status */
    link_result = phy_set_autonegotiate(channel, &link_speed_duplex, &local_pause_bits, &partner_pause_bits);

    if (R_PHY_OK == link_result)
    {
        switch (link_speed_duplex)
        {
            /* Half duplex link */
            case PHY_LINK_100H:
                etherc_adr->ECMR.BIT.DM  = 0;
                etherc_adr->ECMR.BIT.RTM = 1;
                ret                      = ETHER_SUCCESS;
            break;

            case PHY_LINK_10H:
                etherc_adr->ECMR.BIT.DM  = 0;
                etherc_adr->ECMR.BIT.RTM = 0;
                ret                      = ETHER_SUCCESS;
            break;

            /* Full duplex link */
            case PHY_LINK_100F:
                etherc_adr->ECMR.BIT.DM  = 1;
                etherc_adr->ECMR.BIT.RTM = 1;
                full_duplex              = 1;
                ret                      = ETHER_SUCCESS;
            break;

            case PHY_LINK_10F:
                etherc_adr->ECMR.BIT.DM  = 1;
                etherc_adr->ECMR.BIT.RTM = 0;
                full_duplex              = 1;
                ret                      = ETHER_SUCCESS;
            break;

            default:
                ret = ETHER_ERR_OTHER;
            break;
        }

        /* At the communicate mode usually */
        if (ETHER_SUCCESS == ret)
        {
            if (NO_USE_MAGIC_PACKET_DETECT == mode)
            {
                
                /* When pause frame is used */
                if ((full_duplex) && (ETHER_FLAG_ON == pause_frame_enable[channel]))
                {
                    /* Set automatic PAUSE for 512 bit-time */
                    etherc_adr->APR.LONG = 0x0000FFFF;

                    /* Set unlimited retransmit of PAUSE frames */
                    etherc_adr->TPAUSER.LONG = 0;

                    /* PAUSE flow control FIFO settings. */
                    edmac_adr->FCFTR.LONG = 0x00000000;

                    /* Control of a PAUSE frame whose TIME parameter value is 0 is enabled. */
                    etherc_adr->ECMR.BIT.ZPF = 1;

                    /**
                     * Enable PAUSE for full duplex link depending on
                     * the pause resolution results
                     */
                    ether_pause_resolution(local_pause_bits, partner_pause_bits,
                                             &transmit_pause_set, &receive_pause_set);

                    if (XMIT_PAUSE_ON == transmit_pause_set)
                    {
                        /* Enable automatic PAUSE frame transmission */
                        etherc_adr->ECMR.BIT.TXF = 1;
                    }
                    else
                    {
                        /* Disable automatic PAUSE frame transmission */
                        etherc_adr->ECMR.BIT.TXF = 0;
                    }

                    if (RECV_PAUSE_ON == receive_pause_set)
                    {
                        /* Enable reception of PAUSE frames */
                        etherc_adr->ECMR.BIT.RXF = 1;
                    }
                    else
                    {
                        /* Disable reception of PAUSE frames */
                        etherc_adr->ECMR.BIT.RXF = 0;
                    }
                }

