pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
                /* When pause frame is not used */
                else
                {
                    /* Disable PAUSE for half duplex link */
                    etherc_adr->ECMR.BIT.TXF = 0;
                    etherc_adr->ECMR.BIT.RXF = 0;
                }

                /* Set the promiscuous mode bit */
                etherc_adr->ECMR.BIT.PRM = promiscuous_mode[channel];

                /* Enable receive and transmit. */
                etherc_adr->ECMR.BIT.RE = 1;
                etherc_adr->ECMR.BIT.TE = 1;

                /* Enable EDMAC receive */
                edmac_adr->EDRRR.LONG = 0x1;
            }

            /* At the magic packet detection mode */
            else
            {
                /* The magic packet detection is permitted. */
                etherc_adr->ECMR.BIT.MPDE = 1;

                /* Because data is not transmitted for the magic packet detection waiting, 
                   only the reception is permitted. */
                etherc_adr->ECMR.BIT.RE = 1;

                /*
                 * The reception function of EDMAC keep invalidity 
                 * because the receive data don't need to be read when the magic packet detection mode.
                 */
            }
        }
    }
    else
    {
        ret = ETHER_ERR_OTHER;
    }

    return ret;
} /* End of function ether_do_link() */

/***********************************************************************************************************************
* Function Name: ether_set_callback
* Description  : Set the callback function
* Arguments    : control -
*                    Callback function pointer. 
*                    If you would rather poll for finish then please input FIT_NO_FUNC for this argument.
* Return Value : ETHER_SUCCESS
*                    Processing completed successfully
***********************************************************************************************************************/
static ether_return_t ether_set_callback(ether_param_t const control)
{
    void                (*pcb_func)(void *);

    pcb_func = control.ether_callback.pcb_func;

    /* Check callback function pointer, of whether or NULL FIT_NO_FUNC */
    if ((NULL != pcb_func) && (FIT_NO_FUNC != pcb_func))
    {
        cb_func.pcb_func = pcb_func;                        /* Set the callback function */
    }

    return ETHER_SUCCESS;
} /* End of function ether_set_callback() */

/***********************************************************************************************************************
* Function Name: ether_set_promiscuous_mode
* Description  : Set promiscuous mode bit
* Arguments    : control -
*                    Promiscuous mode bit
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN - 
*                    Nonexistent channel number
***********************************************************************************************************************/
static ether_return_t ether_set_promiscuous_mode(ether_param_t const control)
{
    ether_promiscuous_t   * p_arg;
    uint32_t                channel;

    p_arg   = control.p_ether_promiscuous;
    channel = p_arg->channel;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    else
    {
        promiscuous_mode[channel] = p_arg->bit;
    }
    return ETHER_SUCCESS;
} /* End of function ether_set_promiscuous_mode() */

/***********************************************************************************************************************
* Function Name: ether_set_int_handler
* Description  : Set the interrupt handler
* Arguments    : control -
*                    Interrupt handler pointer.
*                    If you would rather poll for finish then please input FIT_NO_FUNC for this argument.
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_ARG -
*                    Invalid argument
***********************************************************************************************************************/
static ether_return_t ether_set_int_handler(ether_param_t const control)
{
    void                (*pcb_int_hnd)(void *);
    ether_return_t      ret = ETHER_ERR_INVALID_ARG;

    pcb_int_hnd = control.ether_int_hnd.pcb_int_hnd;
    if (NULL != pcb_int_hnd)
    {
        cb_func.pcb_int_hnd = pcb_int_hnd;
        ret                 = ETHER_SUCCESS;
    }
    return ret;
}  /* End of function ether_set_int_handler() */

/***********************************************************************************************************************
* Function Name: ether_power_on
* Description  : Turns on power to a ETHER channel.
* Arguments    : control -
*                    Ethernet channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN -
*                    Nonexistent channel number
*                ETHER_ERR_CHAN_OPEN -
*                    Indicates the Ethernet cannot be opened because it is being used by another application
*                ETHER_ERR_INVALID_ARG -
*                    Invalid argument
***********************************************************************************************************************/
static ether_return_t ether_power_on(ether_param_t const control)
{
    uint32_t                                    channel;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;
    ether_return_t                              ret;
    
    ret     = ETHER_ERR_INVALID_ARG;
    channel = (uint32_t)control.channel;
    
    if (ETHER_CHANNEL_MAX > channel)
    {
        pether_ch  = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;

        /* Set port connect */
        ether_port_enable(pether_ch[phy_access].port_connect);

        /* ETHERC/EDMAC Power on */
        ret = power_on_control(channel);
    }
    return ret;
}  /* End of function ether_power_on() */

