pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
* Function Name: ether_power_off
* Description  : Turns on power to a ETHER channel.
* Arguments    : control -
*                    Ethernet channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_ARG -
*                    Invalid argument
***********************************************************************************************************************/
static ether_return_t ether_power_off(ether_param_t const control)
{
    uint32_t            channel;
    ether_return_t      ret;
    
    ret     = ETHER_ERR_INVALID_ARG;
    channel = (uint32_t)control.channel;
    
    if (ETHER_CHANNEL_MAX > channel)
    {
        /* ETHERC/EDMAC Power off */
        power_off_control(channel);
        ret = ETHER_SUCCESS;
    }
    return ret;
}  /* End of function ether_power_off() */

/***********************************************************************************************************************
* Function Name: power_on
* Description  : Turns on power to a ETHER channel.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN -
*                    Nonexistent channel number
*                ETHER_ERR_CHAN_OPEN -
*                    Indicates the Ethernet cannot be opened because it is being used by another application
***********************************************************************************************************************/
static ether_return_t power_on(uint32_t channel)
{
    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        /* Should never get here. Valid channel number is checked above. */
        return ETHER_ERR_INVALID_CHAN;
    }

    /* Attempt to obtain lock so we know we have exclusive access to ETHER channel. */
    if (false == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_ETHERC0 + channel)))
    {
        return ETHER_ERR_CHAN_OPEN;
    }
    
    /* Attempt to obtain lock so we know we have exclusive access to EDMAC channel. */
    if (false == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_EDMAC0 + channel)))
    {
        /* Release reservation on peripheral. */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_ETHERC0 + channel));
        return ETHER_ERR_CHAN_OPEN;
    }

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Enable selected ETHERC/EDMAC Channel. */
    if (ETHER_CHANNEL_0 == channel)
    {
        MSTP(EDMAC0) = 0;
    }
    else
    {
        MSTP(EDMAC1) = 0;
    }
    
    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    
    return ETHER_SUCCESS;
} /* End of function power_on() */

/***********************************************************************************************************************
* Function Name: power_off
* Description : Turns off power to a ETHER channel.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : none
***********************************************************************************************************************/
static void power_off(uint32_t channel)
{

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        /* Should never get here. Valid channel number is checked above. */
        return;
    }

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    
    /* Enable selected ETHERC/EDMAC Channel. */
    if (ETHER_CHANNEL_0 == channel)
    {
        MSTP(EDMAC0) = 1;
    }
    else
    {
        MSTP(EDMAC1) = 1;
    }
    
    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    
    /* Release reservation on peripheral. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_ETHERC0 + channel));
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_EDMAC0 + channel));

} /* End of function power_off() */

/***********************************************************************************************************************
* Function Name: power_on_control
* Description  : Powers on the channel if the ETHEC channel used and the PHY access channel are different, or if the 
*                PHY access channel is powered off.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : ETHER_SUCCESS -
*                    Processing completed successfully
*                ETHER_ERR_INVALID_CHAN -
*                    Nonexistent channel number
*                ETHER_ERR_CHAN_OPEN -
*                    Indicates the Ethernet cannot be opened because it is being used by another application
*              : ETHER_ERR_OTHER -
*                    
***********************************************************************************************************************/
static ether_return_t power_on_control(uint32_t channel)
{
    ether_return_t  ret = ETHER_ERR_OTHER;

    etherc_edmac_power_cont[ether_phy_access[channel]] [channel] = 1;

    if(channel != ether_phy_access[channel])
    {
        ret = power_on(channel);
        if (ETHER_SUCCESS != ret)
        {
            return ret;
        }
    }
    

    if (!(( 1 == etherc_edmac_power_cont[ether_phy_access[channel]] [0] ) &&
         ( 1 == etherc_edmac_power_cont[ether_phy_access[channel]] [1] )))
    {

        ret = power_on(ether_phy_access[channel]);
    }
    
    return ret;
    
} /* End of function power_on_control() */

/***********************************************************************************************************************
* Function Name: power_off_control
* Description  : Powers off the channel if the ETHEC channel used and the PHY access channel are different, or if the 
*                PHY access channel is powered off.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : none
***********************************************************************************************************************/
static void power_off_control(uint32_t channel)
{
    etherc_edmac_power_cont[ether_phy_access[channel]] [channel] = 0;

    if(channel != ether_phy_access[channel])
    {
        power_off(channel);
    }
    
