pwbf/RX64M_Vibration/src/r_ether_rx/src/r_ether_rx.c
    if(( 0 == etherc_edmac_power_cont[ether_phy_access[channel]] [0] ) &&
       ( 0 == etherc_edmac_power_cont[ether_phy_access[channel]] [1] ))
    {

        power_off(ether_phy_access[channel]);
    }
} /* End of function power_off_control() */


/***********************************************************************************************************************
* Function Name: check_mpde_bit
* Description  : 
* Arguments    : none
* Return Value : 1: Magic Packet detection is enabled.
*                0: Magic Packet detection is disabled.
***********************************************************************************************************************/
static uint8_t check_mpde_bit(void)
{
          /* The MPDE bit can be referred to only when ETHERC0 operates. */
    if (  ( ((1 == etherc_edmac_power_cont[0][0]) || (1 == etherc_edmac_power_cont[1][0]))
               && (1 == ETHERC0.ECMR.BIT.MPDE)
               )

          /* The MPDE bit can be referred to only when ETHERC1 operates. */
       || ( ((1 == etherc_edmac_power_cont[0][1]) || (1 == etherc_edmac_power_cont[1][1]))
               && (1 == ETHERC1.ECMR.BIT.MPDE)
               )
        )
    {
        return 1;
    }
    else
    {
        return 0;
    }
} /* End of function check_mpde_bit() */

/***********************************************************************************************************************
* Function Name: ether_eint0
* Description  : EINT0 interrupt processing (A callback function to be called from r_bsp.)
* Arguments    : pparam -
*                    unused
* Return Value : none
***********************************************************************************************************************/
static void ether_eint0(void * pparam)
{
    volatile uint32_t   dummy;

    ether_int_common(ETHER_CHANNEL_0);

    dummy = (uint32_t)pparam;
} /* End of function ether_eint0() */

/***********************************************************************************************************************
* Function Name: ether_eint1
* Description  : EINT1 interrupt processing (A callback function to be called from r_bsp.)
* Arguments    : pparam -
*                    unused
* Return Value : none
***********************************************************************************************************************/
static void ether_eint1(void * pparam)
{
    volatile uint32_t   dummy;

    ether_int_common(ETHER_CHANNEL_1);

    dummy = (uint32_t)pparam;
} /* End of function ether_eint1() */

/***********************************************************************************************************************
* Function Name: ether_int_common
* Description  : Interrupt handler for Ethernet receive and transmit interrupts.
* Arguments    : channel -
*                    ETHERC channel number
* Return Value : none
***********************************************************************************************************************/
static void ether_int_common(uint32_t channel)
{
    uint32_t    status_ecsr;
    uint32_t    status_eesr;
    volatile struct st_etherc __evenaccess    * etherc_adr;
    volatile struct st_edmac __evenaccess     * edmac_adr;
    const ether_control_t                     * pether_ch;
    uint32_t                                    phy_access;
    ether_cb_arg_t                              cb_arg;

    pether_ch  = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    etherc_adr = pether_ch[phy_access].petherc;
    edmac_adr  = pether_ch[phy_access].pedmac;

    status_ecsr = etherc_adr->ECSR.LONG;
    status_eesr = edmac_adr->EESR.LONG;

    /* Callback : Interrupt handler */
    if ((NULL != cb_func.pcb_int_hnd) && (FIT_NO_FUNC != cb_func.pcb_int_hnd))
    {
        cb_arg.channel     = channel;
        cb_arg.status_ecsr = status_ecsr;
        cb_arg.status_eesr = status_eesr;
        (*cb_func.pcb_int_hnd)((void *)&cb_arg);
    }

    /* When the ETHERC status interrupt is generated */
    if (status_eesr & EMAC_ECI_INT)
    {
        /* When the link signal change interrupt is generated */
        if (status_ecsr & EMAC_LCHNG_INT)
        {
            /* The state of the link signal is confirmed and Link Up/Down is judged. */
            /* When becoming Link up */
            if (ETHER_CFG_LINK_PRESENT == etherc_adr->PSR.BIT.LMON)
            {
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;
            }

            /* When Link becomes down */
            else
            {
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_OFF;
            }
        }

        /* When the Magic Packet detection interrupt is generated */
        if (status_ecsr & EMAC_MPD_INT)
        {
            mpd_flag[channel] = ETHER_FLAG_ON;
        }

        /*
         * Because each bit of the ECSR register is cleared when one is written, 
         * the value read from the register is written and the bit is cleared. 
         */
        /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */
        etherc_adr->ECSR.LONG = status_ecsr;
    }
    
    /* This is sample code */
    /* Whether it is a necessary code is confirmed. */
    if (status_eesr & EMAC_RFCOF_INT)
    {
        /* do nothing */
    }
    if (status_eesr & EMAC_TC_INT)
    {
        /* do nothing */
    }
    if (status_eesr & EMAC_FR_INT)
    {
        /* do nothing */
    }
    
    if (status_eesr & EMAC_RDE_INT)
    {
        /* do nothing */
    }
    
    if (status_eesr & EMAC_RFOF_INT)
    {
        /* do nothing */
    }

    /*
     * Because each bit of the EESR register is cleared when one is written, 
     * the value read from the register is written and the bit is cleared. 
     */
    edmac_adr->EESR.LONG  = status_eesr; /* Clear EDMAC status bits */

     /* Whether it is a necessary code is confirmed. */

} /* End of function ether_int_common() */

